{
    "navigation": {
        "home": "Beranda",
        "about": "Tentang Saya",
        "projects": "Proyek",
        "blog": "Blog",
        "getInTouch": "Hubungi Saya",
        "brand": "./ojaan"
    },
    "heroSection": {
        "HeroText": "DEVELOPER FULL-STACK.",
        "tech": "{ Node JS, Tailwind CSS, NextJS, MongoDB, ReactJS, MySQL... }",
        "intro": "Spesialisasi di MERN Stack. Saya memanfaatkan teknologi mutakhir untuk mewujudkan proyek web.",
        "seeMyWorksBtn": "Lihat karya saya",
        "downloadcv": "Unduh CV"
    },
    "aboutSection": {
        "abouttitle": "Pemecah Masalah <Code />",
        "aboutdesc": "Seorang developer Full-Stack independen dengan lebih dari 3 tahun pengalaman.",
        "aboutp1": "Halo, saya Fauzan Salam Mutaqin, seorang siswa dari SMAN 81 Jakarta yang memiliki minat bakat kuat dalam bidang bug hunting dan pemrograman.",
        "aboutp2": "Keahlian saya terutama di bidang coding, MongoDB, MySQL.",
        "aboutp3": "Saya senang terus mempelajari teknologi baru dan mengikuti tren industri terkini. Saya berkembang dalam lingkungan tim, karena percaya bahwa kolaborasi mendorong inovasi, namun saya juga mampu bekerja secara efektif secara mandiri.",
        "aboutp4": "Dengan semangat untuk terus berkembang dan berkontribusi di industri teknologi, saya siap menghadapi tantangan baru dalam pengembangan perangkat lunak."
    },

    "skillsSection": {
        "node": {
            "desc": "Membangun aplikasi web backend tingkat lanjut menggunakan Node.js",
            "name": "Node JS"
        },
        "react": {
            "desc": "Keterampilan dalam membangun SPA modern dan aplikasi web",
            "name": "React JS"
        },
        "next": {
            "desc": "Rendering sisi server yang cepat, routing dinamis, dan kode minimalis",
            "name": "Next JS"
        },
        "git": {
            "desc": "Alat DevOps untuk mengelola kode sumber",
            "name": "Git"
        },
        "tailwind": {
            "desc": "Kerangka kerja CSS frontend yang serbaguna dan sering digunakan",
            "name": "Tailwind CSS"
        },
        "mongo": {
            "desc": "Menggunakan MongoDB untuk manajemen basis data backend yang dapat diskalakan",
            "name": "Mongo DB"
        },
        "mysql": {
            "desc": "Manajemen basis data relasional, membangun aplikasi yang dapat diskalakan",
            "name": "MySQL"
        },
        "firebase": {
            "desc": "Membangun aplikasi, basis data, autentikasi, dan layanan cloud",
            "name": "Firebase"
        },
        "socketio": {
            "desc": "Komunikasi real-time, manajemen acara, koneksi terorganisir, penanganan kesalahan",
            "name": "Socket.io"
        }
    },

    "projectsSection": {
        "title": "Proyek {Dev} Saya",
        "desc": "Dari Aplikasi Mobile hingga Website",
        "projectdesc": {
            "1": "Simulasi kredit menggunakan bahasa pemrograman PHP, untuk menghitung jumlah anuitas, flat, dan efektif, 90% akurat.",
            "2": "Kelas hacker adalah platform yang dibuat oleh departemen CDMS PIDAS81, yang bertujuan untuk melatih anggota CDMS tentang IT.",
            "3": "E-learning CDMS dibuat dengan tujuan memudahkan anggota menyelesaikan tugas dan mengumpulkan tugas.",
            "4": "Rekonstruksi website PIDAS81, untuk menjadi lebih keren tetapi masih dalam tahap pengembangan."
        },
        "projectTitle": {
            "1": "Simulasi Kredit",
            "2": "Platform Kelas Hacker",
            "3": "E-learning CDMS",
            "4": "PIDAS81"
        },
        "projectTech": {
            "1": { "a": "PHP", "b": "Bootstrap" },
            "2": { "a": "PHP", "b": "MySQL" },
            "3": { "a": "MySQL", "b": "Laravel" },
            "4": "CodeIgniter"
        },
        "demobtn": "Lihat Demo",
        "repobtn": "Kode Sumber",
        "seeallbtn": "Lihat Semua Proyek"
    },
    "contactSection": {
        "title": "Mari [Bekerja] Bersama",
        "desc": "Mari Diskusikan dan Mulai Kontrak.",
        "subjectplc": "Subjek",
        "nameplc": "Nama Anda",
        "emailplc": "Email",
        "msgplc": "Masukkan pesan Anda",
        "sendbtn": "Kirim Email"
    },
    "footerSection": {
        "name": "Fauzan Salam M",
        "footer": "Terima kasih telah mengunjungi situs web saya! Semoga Anda menikmati konten yang telah saya siapkan. Nikmati dan jangan lupa untuk berkunjung lagi!",
        "cr": "Hak Cipta © 2024. Semua hak dilindungi.",
        "email": "ojanxsec@gmail.com",
        "address": "Jakarta, DKI Jakarta"
    },
    "utils": {
        "404": "Tidak ada proyek yang sesuai dengan kriteria pencarian Anda.",
        "bckbtn": "Kembali ke beranda",
        "srch": "Cari berdasarkan judul atau stack teknologi...",
        "500": { "title": "Halaman ini sedang dalam pengembangan.", "desc": "Kami bekerja keras untuk memberikan Anda pengalaman terbaik!" },
        "notfound": {
            "title": "Halaman Tidak Ditemukan",
            "desc": "Maaf, halaman yang Anda cari tidak ada. Silakan periksa URL atau kembali ke beranda."
        }
    }
}
