{
    "navigation": {
        "home": "Tepas",
        "about": "Tentang Kuring",
        "projects": "Proyék",
        "blog": "Blog",
        "getInTouch": "Hubungan Kuring",
        "brand": "./ojaan"
    },
    "heroSection": {
        "HeroText": "PANGEMBANG FULL-STACK.",
        "tech": "{ Node JS, Tailwind CSS, NextJS, MongoDB, ReactJS, MySQL... }",
        "intro": "Khusus dina MERN Stack. Kuring ngamangpaatkeun téknologi panganyar pikeun ngawujudkeun proyék web.",
        "seeMyWorksBtn": "Tingali karya abdi",
        "downloadcv": "Unduh CV"
    },
    "aboutSection": {
        "abouttitle": "Pamecah Masalah <Code />",
        "aboutdesc": "Saurang pangembang Full-Stack mandiri kalayan langkung ti 3 taun pangalaman.",
        "aboutp1": "Wilujeng tepang, abdi Fauzan Salam Mutaqin, siswa ti SMAN 81 Jakarta anu gaduh minat sareng bakat anu kuat dina widang bug hunting sareng pemrograman.",
        "aboutp2": "Katerampilan abdi utamina di widang coding, MongoDB, MySQL.",
        "aboutp3": "Abdi resep diajar téknologi anyar sareng teras ngamutahirkeun kanyaho ku nuturkeun tren industri terkini. Abdi sok siap damel dina tim sabab yakin yén kolaborasi ngadorong inovasi, sanajan abdi ogé tiasa damel sacara mandiri.",
        "aboutp4": "Kalayan sumanget pikeun terus mekarkeun diri sareng nyumbang dina industri téknologi, abdi siap pikeun nyanghareupan tangtangan anyar dina widang pangembangan software."
    },

    "skillsSection": {
        "node": {
            "desc": "Ngawangun aplikasi web backend anu maju ngagunakeun Node.js",
            "name": "Node JS"
        },
        "react": {
            "desc": "Kahadean dina ngawangun SPA modern sareng aplikasi web",
            "name": "React JS"
        },
        "next": {
            "desc": "Rendering server-side anu gancang, routing dinamis, sareng kode minimalis",
            "name": "Next JS"
        },
        "git": {
            "desc": "Alat DevOps pikeun ngatur kode sumber",
            "name": "Git"
        },
        "tailwind": {
            "desc": "Kerangka CSS frontend anu luwes sareng mindeng dianggo",
            "name": "Tailwind CSS"
        },
        "mongo": {
            "desc": "Ngagunakeun MongoDB pikeun manajemen basis data backend anu tiasa diukur",
            "name": "Mongo DB"
        },
        "mysql": {
            "desc": "Manajemén basis data relasional, ngawangun aplikasi anu tiasa diukur",
            "name": "MySQL"
        },
        "firebase": {
            "desc": "Ngembangkeun aplikasi, basis data, oténtikasi, sareng layanan cloud",
            "name": "Firebase"
        },
        "socketio": {
            "desc": "Komunikasi real-time, manajemén acara, sambungan anu tertib, sareng penanganan kasalahan",
            "name": "Socket.io"
        }
    },

    "projectsSection": {
        "title": "Proyék {Dev} Kuring",
        "desc": "Ti Aplikasi Mobile nepi ka Website",
        "projectdesc": {
            "1": "Simulasi kredit ngagunakeun basa pamrograman PHP, pikeun ngitung jumlah anuitas, flat, sareng éféktif, akurat nepi ka 90%.",
            "2": "Kelas hacker mangrupakeun platform anu dijieun ku departemen CDMS PIDAS81, anu boga tujuan pikeun ngalatih anggota CDMS ngeunaan IT.",
            "3": "E-learning CDMS dijieun kalayan tujuan pikeun mempermudah anggota ngalengkepan tugas sareng ngirim tugas.",
            "4": "Rekonstruksi website PIDAS81, diparanti supaya langkung keren tapi masih dina tahap pamekaran."
        },
        "projectTitle": {
            "1": "Simulasi Kredit",
            "2": "Platform Kelas Hacker",
            "3": "E-learning CDMS",
            "4": "PIDAS81"
        },
        "projectTech": {
            "1": { "a": "PHP", "b": "Bootstrap" },
            "2": { "a": "PHP", "b": "MySQL" },
            "3": { "a": "MySQL", "b": "Laravel" },
            "4": "CodeIgniter"
        },
        "demobtn": "Tingali Demo",
        "repobtn": "Kode Sumber",
        "seeallbtn": "Tingali Sadaya Proyék"
    },
    "contactSection": {
        "title": "Hayu urang [Gawé] Babarengan",
        "desc": "Hayu urang ngobrol sareng ngamimitian kontrak.",
        "subjectplc": "Judul",
        "nameplc": "Nami anjeun",
        "emailplc": "Surélék",
        "msgplc": "Lebetkeun pesen anjeun",
        "sendbtn": "Kirim Surélék"
    },
    "footerSection": {
        "name": "Fauzan Salam M",
        "footer": "Hatur nuhun parantos nganjang ka situs web abdi! Mugia anjeun nampi manfaat tina eusi anu parantos disiapkeun. Wilujeng ngaraosan sareng tong hilap nganjang deui!",
        "cr": "Hak Cipta © 2024. Sadaya hak ditangtayungan.",
        "email": "ojanxsec@gmail.com",
        "address": "Jakarta, DKI Jakarta"
    },
    "utils": {
        "404": "Teu aya proyék anu nyocogkeun kana kriteria pilarian anjeun.",
        "bckbtn": "Balik deui ka tepas",
        "srch": "Pilarian dumasar judul atanapi téknologi...",
        "500": { "title": "Halaman ieu keur diwangun.", "desc": "Kami nuju damel satékah polah pikeun nyayogikeun pangalaman anu pangsaéna!" },
        "notfound": {
            "title": "Halaman Henteu Kapanggih",
            "desc": "Hapunten, halaman anu anjeun pilari teu aya. Mangga parios URL atanapi balik deui ka tepas."
        }
    }
}
